Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: However, when you are working with your own resources, you might need to perform some additional cleanup yourself.
ja: しかし、あなたがあなた独自のリソース（計算資源）を扱うとき、あなたは追加のいくらかの掃除をあなた自身でする必要があるかもしれません。

source: However, when you specifically want an overflow condition to truncate the number of available bits, you can opt in to this behavior rather than triggering an error.
ja: しかし、あなたがに利用できるビットの数を切り詰めるために特にオーバフロー条件を望むとき、あなたはエラーを引き起こすのではなくこの挙動を選ぶことができます。

source: However, with ARC, values are deallocated as soon as their last strong reference is removed, making weak references unsuitable for such a purpose.
ja: しかしながら、ARCでは、値はその最後の強い参照が削除されるやいなや割り当て解除されて、弱い参照をそのような目的のためにふさわしくないものにします。

source: However, you call type methods on the type, not on an instance of that type.
ja: しかし、あなたは型のメソッドを型の上で呼び出します、その型のインスタンスの上ではなく。

source: However, you can also define computed variables and define observers for stored variables, in either a global or local scope.
ja: しかし、あなたはまた、計算変数を定義すること、そして格納変数のためにオブザーバーを定義することが、グローバルなまたはローカルなスコープのどちらにおいても可能です。

source: However, you can downcast from a protocol type to an underlying type in the same way you can downcast from a superclass to a subclass, as discussed in Downcasting.
ja: しかしながら、あなたはあるプロトコル型からある基礎をなす型へとダウンキャストすることが、あなたがスーパークラスからサブクラスへとダウンキャスト出来るのと同じ方法で可能です、ダウンキャストで記述されるように。

source: However, you can provide explicit argument labels using the same syntax that functions, methods, and initializers use.
ja: しかしながら、あなたは明示的に引数ラベルを提供することが、関数、メソッド、およびイニシャライザが使うのと同じ構文を使うことで可能です。

source: However, you can still change tenEighty.frameRate and alsoTenEighty.frameRate because the values of the tenEighty and alsoTenEighty constants themselves don’t actually change.
ja: しかし、あなたはそれでもなおtenEighty.frameRateとalsoTenEighty.frameRateを変更することができます、なぜならtenEightyおよびalsoTenEighty定数それら自身の値は実のところ変わらないからです。

source: However, you can’t construct an instance of a protocol, because protocols do not actually provide the implementations for the requirements they specify.
ja: しかし、あなたはプロトコルからインスタンスを造ることができません、なぜならプロトコルは実際にはそれらが指定する要件に対する実装を用意しないからです。

source: However, you don’t always have to write the type explicitly.
ja: しかし、あなたは必ずしも明確に型を書く必要はありません。

source: Identical to (===)
ja: 同一である（===）

source: Identifier Pattern
ja: 識別子パターン

source: Identifiers
ja: 識別子

source: Identifiers patterns within a value-binding pattern bind new named variables or constants to their matching values.
ja: ある値束縛パターン内の複数の識別子パターンは、複数の新しい名前をつけられた変数または定数を、それらがマッチしている値に縛りつけます。

source: Identity Operators
ja: 同一性演算子

source: If someThrowingFunction() throws an error, the value of x and y is nil.
ja: someThrowingFunction()がエラーをスローするならば、xとyの値はnilです。

source: If tenEighty and alsoTenEighty were far apart in your program’s code, it could be difficult to find all the ways that the video mode is changed.
ja: tenEightyとalsoTenEightyがあなたのプログラムのコードの中で離ればなれになってしまったら、ビデオモードが変更される全ての道筋を見つけるのは難しくなるかもしれません。

source: If true, execution continues to step 2.
ja: trueならば、実行はステップ２に続きます。

source: If true, execution returns to step 1.
ja: trueならば、実行はステップ１に戻ります。

source: If false, the program is finished executing the repeat-while statement.
ja: falseならば、プログラムはrepeat-while文の実行を終了します。

source: If false, the program is finished executing the while statement.
ja: falseならば、プログラムはwhile文の実行を終了します。

source: If a and b aren’t of the same type, it isn’t possible to swap their values.
ja: aとbが同じ型でないならば、それらの値を交換することは可能ではありません。

source: If count is already zero, the method returns 0 to indicate that no further counting should take place.
ja: countがすでにゼロであるならば、メソッドは0を返して、これ以上数えることは必要ないことを示します。

source: If square is valid, the value stored in board[square] is added to the current square value to move the player up or down any ladders or snakes.
ja: squareが有効ならば、board[square]に格納される値は現在のsquareの値に加えられて、はしごや蛇があればプレーヤーを上や下に動かします。

source: If question is true, it evaluates answer1 and returns its value; otherwise, it evaluates answer2 and returns its value.
ja: questionが真実ならば、それはanswer1を評価して、その値を返します；そうでなければ、それはanswer2を評価して、その値を返します。

source: If Statement
ja: if文

source: If Statements and Forced Unwrapping
ja: if文と強制アンラップ

source: If a String is empty, startIndex and endIndex are equal.
ja: あるStringが空ならば、startIndexとendIndexは同じです。

source: If a catch clause doesn’t have a pattern, the clause matches any error and binds the error to a local constant named error.
ja: catch節がパターンを持たないならば、その節はあらゆるエラーにマッチします、そしてそのエラーをerrorと名前を付けられるローカル定数に束縛します。

source: If a catch clause does not specify a pattern, the catch clause matches and binds any error to a local constant named error.
ja: あるcatch節がパターンを指定しないならば、そのcatch節はマッチしてあらゆるエラーをerrorと名前をつけられるローカル定数に束縛します。

source: If a where clause is present, the statements within the relevant case are executed only if the value of the control expression matches one of the patterns of the case and the expression of the where clause evaluates to true.
ja: where節が存在するならば、関連するケース節の範囲内のいくらかの文は、制御式の値がケース節のパターンの１つとマッチして、そしてwhere節がtrueに評価される場合にだけ、実行されます。

source: If a class has a superclass, list the superclass name before any protocols it adopts, followed by a comma:
ja: あるクラスがスーパークラスを持つならば、それが採用するあらゆるプロトコルの前に、コンマに続けてスーパークラス名を列記してください：

source: If a closure does not specify a parameter list or return type because they can be inferred from context, place the capture list at the very start of the closure, followed by the in keyword:
ja: クロージャがパラメータ・リストまたは戻り型を、それらが前後関係から推論されることができるために指定しないならば、捕獲リストをクロージャのまさしくその始まりに、inキーワードに続けて置いてください：

source: If a closure expression is provided as the function or method’s only argument and you provide that expression as a trailing closure, you do not need to write a pair of parentheses () after the function or method’s name when you call the function:
ja: あるクロージャ式がただ関数やメソッドの引数としてだけ提供され、そしてあなたが後付クロージャとしてその式を提供するならば、あなたがその関数を呼ぶときに、一対の丸括弧()を関数やメソッドの名前の後に書く必要はありません：

source: If a computed property’s setter doesn’t define a name for the new value to be set, a default name of newValue is used.
ja: 計算プロパティのもつセッターがその設定される新しい値に名前を定義しないならば、newValueの省略時の値が使われます。

source: If a conforming type provides its own implementation of a required method or property, that implementation will be used instead of the one provided by the extension.
ja: 準拠している型がある必須のメソッドやプロパティのそれ自身の実装を提供する場合は、その実装が拡張によって提供されるものの代わりに使用されます。

source: If a conforming type satisfies the requirements for multiple constrained extensions that provide implementations for the same method or property, Swift uses the implementation corresponding to the most specialized constraints.
ja: ある準拠型が同じメソッドやプロパティに対する実装を提供する複数の制約拡張に対する要件を満たすならば、スウィフトは最も特殊化した制約と一致する実装を使います。

source: If a constant or variable in your code needs to work with the absence of a value under certain conditions, always declare it as an optional value of the appropriate type.
ja: あなたのコードの中の定数または変数が特定の条件下で値の欠如を取り扱う必要があるならば、常に、それを適切な型のオプショナルの値として宣言してください。

source: If a constant, variable, property, or subscript makes use of a private type, the constant, variable, property, or subscript must also be marked as private:
ja: 定数、変数、プロパティ、または添え字が非公開の型を利用するならば、定数、変数、プロパティ、または添え字はまた、privateと印しされなければなりません：

source: If a default value is defined, you can omit that parameter when calling the function.
ja: 省略時の値が定義されるならば、あなたは関数を呼ぶときそのパラメータを省略することができます。

source: If a function type has only one parameter and that parameter’s type is a tuple type, then the tuple type must be parenthesized when writing the function’s type.
ja: ある関数型がただ１つだけのパラメータを持ちそしてそのパラメータの型がタプル型であるならば、その場合そのタプル型は関数の型を記述する時に丸括弧に入れられなければなりません。

source: If a function type includes more than a single arrow (->), the function types are grouped from right to left.
ja: ある関数型がただ１つだけの矢印（->）ではなくもっと多く含むならば、その関数型は右から左にグループにされます。

source: If a function with an opaque return type returns from multiple places, all of the possible return values must have the same type.
ja: 不透明戻り型をもつ関数が複数の場所から返るならば、可能な戻り値の全ては、同じ型を持たなければなりません。

source: If a match is found, one of the switch statement’s cases sets an optional Int? variable called possibleIntegerValue to an appropriate integer value.
ja: ひとつの適合が見つけられるならば、switch文のケース節の１つは、possibleIntegerValueと呼ばれるあるオプショナルのInt?変数を適切な整数値に設定します。

source: If a match is found, the program executes the statements listed within the scope of that case.
ja: マッチが見つけられるならば、プログラムはそのケース節のスコープ内で列記される文を実行します。

source: If a nonfailable initializer delegates to an init! failable initializer that fails and returns nil, then a runtime error is raised (as if you used the ! operator to unwrap an optional that has a nil value).
ja: 失敗できないイニシャライザが、ある失敗してnilを返す失敗できるイニシャライザinit!へと委任するならば、その時は実行時エラーが（まるであなたがnilの値を持つオプショナルをアンラップするために!演算子を使ったかのように）引き起こされます。

source: If a parameter has an argument label, the argument must be labeled when you call the function.
ja: ある引数が引数ラベルを持つならば、その引数は、あなたがその関数を呼ぶ時にラベルを付けられる必要があります。

source: If a particular dice roll would take you beyond square 25, you must roll again until you roll the exact number needed to land on square 25.
ja: ある特定のさいころを振る回が、正方形25を越えてあなたを連れて行くならば、あなたは正方形25に到着するのに必要な正確な数を出すまで、再びさいころを振らなければなりません。

source: If a period appears at the beginning of a line, it is understood as part of an explicit member expression, not as an implicit member expression.
ja: ピリオドがある行の初めに現れたならば、それはある明示的なメンバー式の一部として理解されます、ひとつの明示的なメンバー式としてではなく。

source: If a postfix expression that contains an optional-chaining expression is nested inside other postfix expressions, only the outermost expression returns an optional type.
ja: オプショナル連鎖式を含む接尾辞式が、他の接尾辞式の内部に入れ子にされるならば、最も外部の式だけがオプショナル型を返します。

source: If a property always takes the same initial value, provide a default value rather than setting a value within an initializer.
ja: あるプロパティが常に同じ初期値をとるならば、イニシャライザ内で値を設定することよりむしろ省略時の値を提供してください。

source: If a property declaration includes both the get and set keywords, a conforming type can implement it with a stored variable property or a computed property that is both readable and writeable (that is, one that implements both a getter and a setter).
ja: あるプロパティ宣言がgetとsetキーワードを両方とも含むならば、準拠している型はそれを、格納変数プロパティや計算プロパティを使って実装することができます、それは読み出し可能と書き込み可能の両方であるものです（すなわち、ゲッターとセッターのどちらも実装できるもの）。

source: If a property declaration includes only the get keyword, it can be implemented as any kind of property.
ja: プロパティ宣言がgetキーワードだけを含むならば、それはどんな種類のプロパティとしてでも実装されることができます。

source: If a property marked with the lazy modifier is accessed by multiple threads simultaneously and the property has not yet been initialized, there is no guarantee that the property will be initialized only once.
ja: lazy修飾子で印されるプロパティが複数のスレッドによって同時にアクセスされ、そのプロパティがその時まだ初期化されないならば、そのプロパティがただ一度だけ初期化されるとは保障されません。

source: If a protocol is marked with the objc attribute, the AnyObject requirement is implicitly applied to that protocol; there’s no need to mark the protocol with the AnyObject requirement explicitly.
ja: あるプロトコルがobjc属性で印されるならば、AnyObject要件は暗黙的にそのプロトコルに適用されます；AnyObject要件で明示的に印する必要はありません。

source: If a protocol requires a property to be gettable and settable, that property requirement can’t be fulfilled by a constant stored property or a read-only computed property.
ja: あるプロトコルがプロパティに取得可能かつまた設定可能であることを要求するならば、そのプロパティ要件は、定数格納プロパティまたは読み出し専用の計算プロパティによって満たされることができません。

source: If a stored property’s default value requires some customization or setup, you can use a closure or global function to provide a customized default value for that property.
ja: ある格納プロパティの省略時の値が、いくらかの特別な注文または準備を必要とするならば、あなたは特注の省略時の値をそのプロパティのために用意するために、クロージャまたはグローバル関数を使用することができます。

source: If a stored value in your code won’t change, always declare it as a constant with the let keyword.
ja: ある格納された値をあなたのコードにおいて変化させる予定がないならば、常にletキーワードを使ってそれを定数として宣言してください。

source: If a subclass initializer performs no customization in phase 2 of the initialization process, and the superclass has a zero-argument designated initializer, you can omit a call to super.init() after assigning values to all of the subclass’s stored properties.
ja: サブクラスのイニシャライザが初期化過程の第２段階においてなんら特注の挙動を実行しない、そしてスーパークラスがゼロ個引数の指定イニシャライザを持つならば、あなたはサブクラスの持つ格納プロパティの全てに値を割り当てた後、super.init()の呼び出しを省略できます。

source: If a subclass overrides a designated initializer from a superclass, and also implements a matching initializer requirement from a protocol, mark the initializer implementation with both the required and override modifiers:
ja: あるサブクラスが、スーパークラスからの指定イニシャライザをオーバーライドして、またプロトコルからのイニシャライザ要件にも合致するものを実装するならば、そのイニシャライザ実装をrequiredとoverrideの両方の修飾子を使って印してください：

source: If a subscript returns a value of optional type—such as the key subscript of Swift’s Dictionary type—place a question mark after the subscript’s closing bracket to chain on its optional return value:
ja: ある添え字がオプショナル型の値を返すならば ― 例えばスウィフトのDictionary型のキー添え字 ― 疑問符をその添え字の閉じ括弧の後ろに置いて、そのオプショナルの戻り値の上に連鎖を繋げてください：

source: If a type already conforms to all of the requirements of a protocol, but has not yet stated that it adopts that protocol, you can make it adopt the protocol with an empty extension:
ja: ある型があるプロトコルの要件の全てにすでに準拠するが、それがそのプロトコルを採用するとまだ示していなかったならば、あなたは空の拡張を使ってそれがそのプロトコルを採用するようにできます：

source: If a type defines one of these methods, instances of the type can be used in function call syntax.
ja: ある型がそれらメソッドの１つを定義するならば、その型のインスタンスは関数呼び出し構文において使われることができます。

source: If a value (known as a raw value) is provided for each enumeration case, the value can be a string, a character, or a value of any integer or floating-point type.
ja: 値（rawの値として知られるもの）が列挙のケース節の各々のために提供されている場合には、その値は文字列、文字、またはあらゆる整数または浮動小数点型の値であることができます。

source: If all of the associated values for an enumeration case are extracted as constants, or if all are extracted as variables, you can place a single var or let annotation before the case name, for brevity:
ja: 列挙ケース節の関連値の全てが定数として抽出されるならば、または全てが変数として抽出されるならば、あなたは簡潔にvarまたはlet注釈１つだけをケース節名の前に置くことができます：

source: If all the elements are equal, then the tuples themselves are equal.
ja: すべての要素が等しいならば、その時それらのタプル自体が等しいです。

source: If an available attribute only specifies an introduced argument in addition to a platform or language name argument, you can use the following shorthand syntax instead:
ja: available属性がただ１つのintroduced引数をプラットホームまたは言語名引数に加えて指定するならば、あなたは以下の略記構文が代わりに利用可能です：

source: If an audio signal comes in with a higher value than 10, it will be capped to this threshold value (as described below).
ja: ある音声信号が10より高い値でやってくるならば、それはこの限界値に制限されます（下記のように）。

source: If an empty string is found, an initialization failure is triggered.
ja: もし空の文字列が見つけられたならば、初期化失敗が引き起こされます。

source: If an enumeration has raw values, those values are determined as part of the declaration, which means every instance of a particular enumeration case always has the same raw value.
ja: ある列挙が生の値を持つならば、それらの値は宣言の一部として決定されます、それはある特定の列挙ケース節のすべてのインスタンスが常に同じ生の値を持つことを意味します。

source: If an error actually is thrown, you’ll get a runtime error.
ja: エラーが実際はスローされるならば、あなたは実行時エラーを受け取るでしょう。

source: If an error is thrown and it matches the SandwichError.outOfCleanDishes case, then the washDishes() function will be called.
ja: エラーがスローされてそれがSandwichError.outOfCleanDishesケース節にマッチするならば、そのときwashDishes()関数が呼ばれます。

source: If an error is thrown and it matches the SandwichError.missingIngredients case, then the buyGroceries(_:) function is called with the associated [String] value captured by the catch pattern.
ja: エラーがスローされてそれがSandwichError.missingIngredientsケース節にマッチするならば、そのときbuyGroceries(_:)関数がそのcatchパターンによってキャプチャされた[String]関連値とともに呼ばれます。

source: If an error is thrown by the code in the do clause, it is matched against the catch clauses to determine which one of them can handle the error.
ja: あるエラーがdo節の中にあるコードによってスローされるならば、それはcatch節と照合されて、それらの１つがそのエラーを処理できると決定されます。

source: If an error is thrown while evaluating the try? expression, the value of the expression is nil.
ja: try?式を評価している間にエラーがスローされるならば、式の値はnilになります。

source: If an error is thrown, execution immediately transfers to the catch clauses, which decide whether to allow propagation to continue.
ja: エラーがスローされるならば、実行は直ちにcatch節に移ります、それは伝達を継続させるかどうか結論を下します。

source: If an implicitly unwrapped optional is nil and you try to access its wrapped value, you’ll trigger a runtime error.
ja: 暗黙的にアンラップされるオプショナルがnilであり、あなたがそれのラップされた値にアクセスしようとするならば、あなたは実行時エラーを引き起こします。

source: If an instance of an optional type contains a value, you can access that value using the postfix operator !, as shown below:
ja: オプショナル型のインスタンスが値を含むならば、あなたが接尾辞演算子!を使用してその値にアクセスすることができます、以下に示すように：

source: If an instance of the extended type or of a type that conforms to the extended protocol satisfies the requirements, the instance gains the behavior specified in the declaration.
ja: 拡張された型のまたは拡張されたプロトコルに準拠する型のインスタンスがrequirements 要件を満たすならば、そのインスタンスは宣言において指定される挙動を獲得します。

source: If an operator doesn’t begin with a dot, it can’t contain a dot elsewhere.
ja: ある演算子がドットで始まらないならば、それはどこか他にドットを含むことはできません。

source: If an operator has no whitespace on the left but is followed immediately by a dot (.), it’s treated as a postfix unary operator.
ja: ある演算子が左側では空白を持たないが直ちに続けて１つのドット（.）を持つならば、それは接尾辞単項演算子と見なされます。

source: If an operator has whitespace around both sides or around neither side, it’s treated as a binary operator.
ja: ある演算子が、空白をそのまわりの両側に持つか、そのまわりのどちら側にも持たないならば、それは二項演算子とみなされます。

source: If an operator has whitespace on the left side only, it’s treated as a prefix unary operator.
ja: ある演算子が左側だけで空白を持つならば、それは接頭辞単項演算子とみなされます。

source: If an operator has whitespace on the right side only, it’s treated as a postfix unary operator.
ja: ある演算子が右側だけで空白を持つならば、それは接尾辞単項演算子とみなされます。

source: If an optional has a value, it’s considered to be “not equal to” nil:
ja: あるオプショナルが値を持つならば、それはnilと「同等でない」と判断されます：

source: If any of the patterns match, then the case is considered to match.
ja: それらのパターンのどれかが合致するならば、そのときそのケース節は合致するとみなされます。

source: If any of the values in the optional bindings are nil or any Boolean condition evaluates to false, the whole if statement’s condition is considered to be false.
ja: 何れかのオプショナル束縛の中の値がnilであるか何かのブール条件の評価がfalseになるならば、if文の条件の全体がfalseであるとみなされます。

source: If casting to the specified type is guaranteed to fail or is guaranteed to succeed, a compile-time error is raised.
ja: 指定された型へのキャストが失敗すると保証されるまたは成功すると保証される場合には、コンパイル時エラーが引き起こされます。

source: If either value is false, the overall expression will also be false.
ja: どちらかの値がfalseならば、全体的な式もまたfalseになります。

source: If it doesn’t, the new value the convenience initializer assigns will be overwritten by its own class’s designated initializer.
ja: それがそうしないならば、便宜イニシャライザが代入する新しい値は、それ自身のクラスの指定イニシャライザによって上書きされます。

source: If it doesn’t, the new value the designated initializer assigns will be overwritten by the superclass as part of its own initialization.
ja: それがそうしないならば、指定イニシャライザが代入する新しい値は、スーパークラスによってそれ自身の初期化の一部として上書きされます。

source: If it is, a message is printed.
ja: もしそうならば、メッセージが出力されます。

source: If it’s not possible to retrieve a value from the increment(forCount:) method—either because dataSource is nil, or because the data source doesn’t implement increment(forCount:)—then the increment() method tries to retrieve a value from the data source’s fixedIncrement property instead.
ja: 値をincrement(forCount:)メソッドから取り出すことが可能でないならば ― dataSourceがnilであるから、またはデータ・ソースがincrement(forCount:)を実装しないからのどちらでも ― その時increment()メソッドはその代わりに値をデータ・ソースのfixedIncrementプロパティから取り出そうとします。

source: If it’s not appropriate to provide a case for every possible value, you can define a default case to cover any values that are not addressed explicitly.
ja: すべてのあり得る値に対してひとつのケース節を用意することが妥当でないならば、あなたはdefault（省略時）ケース節を定義することで、明確に言及されないどんな値にも対応できます。

source: If multiple defer statements appear in the same scope, the order they appear is the reverse of the order they are executed.
ja: 複数のdefer文が同じスコープに現れるならば、それらが現れる順番が、それらが実行される順番の逆です。

source: If no error is thrown, the eatASandwich() function is called.
ja: エラーがスローされないならば、eatASandwich()関数が呼び出されます。

source: If no error is thrown, the remaining statements in the do statement are executed.
ja: エラーがスローされることが全く無いならば、do文に残っている文が遂行されます。

source: If no initializers are declared, and all properties of the class declaration were given initial values, call the class’s default initializer, as described in Default Initializers.
ja: イニシャライザが宣言されない、そして全てのクラス宣言のプロパティが初期値を与えられるならば、クラスの省略時のイニシャライザを呼び出す、省略時のイニシャライザで記述されるように。

source: If no initializers are declared, and all properties of the structure declaration were given initial values, call the structure’s default initializer, as described in Default Initializers.
ja: イニシャライザが宣言されない、そしてその構造体宣言の全てのプロパティが初期値を与えられたならば、構造体の省略時のイニシャライザを呼び出す、省略時のイニシャライザで記述されるように。

source: If no initializers are declared, call the structure’s memberwise initializer, as described in Memberwise Initializers for Structure Types.
ja: イニシャライザが宣言されないならば、その構造体のメンバー関連イニシャライザ呼び出す、構造型のためのメンバー関連イニシャライザで記述されるように。

source: If no pattern is matched, the error gets caught by the final catch clause and is bound to a local error constant.
ja: パターンが適合することが全く無いならば、エラーは最後のcatch節によってキャッチされて、あるローカルerror定数に束縛されます。

source: If none of the catch clauses handle the error, the error propagates to the surrounding scope.
ja: どのcatch節もエラーを処理しないならば、エラーは取り囲んでいるスコープへと伝えられます。

source: If one of the copies of the collection is modified, the elements are copied just before the modification.
ja: そのコレクションのいくつかのコピーのうちの１つが修正されるならば、それら要素はその修正の直前にコピーされます。

source: If part of your code requires a String, type safety prevents you from passing it an Int by mistake.
ja: あなたのコードの一部がStringを要求するならば、型安全はあなたが間違ってそれにIntを渡すことを防ぎます。

source: If part of your code requires a String, you can’t pass it an Int by mistake.
ja: あなたのコードの一部がStringを要求するならば、あなたは誤ってそれにIntを渡すことはできません。

source: If such a determination can be made, the error is considered handled.
ja: そのような決定が為されるならば、エラーは処理されたと判断されます。

source: If that condition is not met, the code inside the else branch is executed.
ja: その条件が満たされないならば、else分岐の内部のコードが実行されます。

source: If the ! or ? predefined operator has no whitespace on the left, it’s treated as a postfix operator, regardless of whether it has whitespace on the right.
ja: あらかじめ定義された演算子!または?が左側に空白を持たないならば、それは接尾辞演算子と見なされます、それが右側に空白を持つかどうかに関係なく。

source: If the Int value does not have enough digits for the requested index, the subscript implementation returns 0, as if the number had been padded with zeros to the left:
ja: Int値には要十分な桁が請されたインデックスに対してないならば、この添え字実装は、まるで数が左にゼロを詰められたように0を返します：

source: If the break statement above did not use the gameLoop label, it would break out of the switch statement, not the while statement.
ja: 上のbreak文がgameLoopラベルを使用しないならば、それは、while文ではなく、switch文から抜け出すでしょう。

source: If the guard statement’s condition is met, code execution continues after the guard statement’s closing brace.
ja: guard文の条件が満たされるならば、コード実行はguard文の閉じ中括弧の後に続きます。

source: If the array argument contains an empty array, the minMax(array:) function, as defined above, will trigger a runtime error when attempting to access array[0].
ja: array引数が空の配列を含んでいるならば、上で定義されるminMax(array:)関数は、array[0]にアクセスしようとする時に実行時エラーを引き起こします。

source: If the case for .west is omitted, this code doesn’t compile, because it doesn’t consider the complete list of CompassPoint cases.
ja: .westのためのcaseが省略されるならば、このコードはコンパイルしません、なぜなら、それがCompassPointのケース節の完全なリストを考慮しないからです。

source: If the quantity is invalid, the entire initialization process fails immediately and no further initialization code is executed.
ja: quantityが無効ならば、初期化処理全体が直ちに失敗して、以降の初期化コードは実行されません。

source: If the delegate property is nil, these delegate calls fail gracefully and without error.
ja: delegateプロパティがnilならば、これらの委任先呼び出しはエラーなしで美しく失敗します。

source: If the delegate property is non-nil, the delegate methods are called, and are passed the SnakesAndLadders instance as a parameter.
ja: delegateプロパティがnilでないならば、委任先のさまざまなメソッドが呼ばれます、そしてパラメータとしてSnakesAndLaddersインスタンスを渡されます。
